# 正規化マップ
NORMALIZE_MAP={
    "その他" => "その他",
    "ア" => "アレルギー科",
    "アレ" => "アレルギー科",
    "アレルギー" => "アレルギー科",
    "ｱﾚ" => "アレルギー科",
    "リ" => "不明",
    "乳外" => "不明",
    "他" => "不明",
    "全" => "不明",
    "内" => "内科",
    "内科" => "内科",
    "口" => "歯科口腔外科",
    "口啌外" => "歯科口腔外科",
    "口外" => "歯科口腔外科",
    "口腔" => "歯科口腔外科",
    "口腔外" => "歯科口腔外科",
    "口腔外科" => "歯科口腔外科",
    "口腔歯科" => "歯科",
    "呼" => "呼吸器科",
    "呼吸" => "呼吸器科",
    "呼吸器" => "呼吸器科",
    "呼内" => "呼吸器科",
    "呼外" => "呼吸器外科",
    "外" => "外科",
    "婦" => "婦人科",
    "婦人" => "婦人科",

    "子" => "小児科",
    "小" => "小児科",
    "小児" => "小児科",

    "小児外" => "その他",
    "小児歯" => "小児歯科",
    "小児歯科" => "小児歯科",
    "小呼外" => "不明",
    "小外" => "不明",
    "小歯" => "小児歯科",
    "小皮" => "不明",
    "形" => "形成外科",
    "形外" => "形成外科",
    "形成" => "形成外科",
    "形成外科" => "形成外科",
    "循" => "循環器科",
    "循環器" => "循環器科",

    "心" => "不明",
    "心内" => "心療内科",
    "心外" => "不明",

    "心療" => "心療内科",
    "心療内" => "心療内科",
    "心療内科" => "心療内科",

    "心臓" => "心臓血管外科",
    "心臓血管外科" => "心臓血管外科",
    "心血" => "心臓血管外科",
    "性" => "性病科",
    "技工" => "不明",
    "放" => "放射線科",
    "放射" => "放射線科",
    "整" => "整形外科",
    "整外" => "整形外科",
    "整形" => "整形外科",
    "整形外" => "整形外科",
    "整形外科" => "整形外科",
    "整（除歯科）" => "不明",

    "歯" => "歯科",

    "歯口" => "歯科口腔外科",

    "歯口外" => "歯科口腔外科",

    "歯口腔" => "歯科口腔外科",

    "歯科" => "歯科",
    "歯科口腔外科" => "歯科口腔外科",
    "歯科口腔科" => "歯科口腔外科",
    "歯腔" => "歯科口腔外科",

    "気" => "気管食道科",

    "泌" => "泌尿器科",
    "泌尿" => "泌尿器科",
    "泌尿器" => "泌尿器科",
    "泌尿器科" => "泌尿器科",

    "消" => "消化器科",
    "消化" => "消化器科",
    "消化器" => "消化器科",

    "消循" => "不明",

    "物" => "不明",
    "物療" => "不明",
    "理" => "理学診療科",
    "理学" => "理学診療科",
    "理診" => "理学診療科",

    "産" => "産科",
    "産婦" => "産婦人科",

    "皮" => "皮膚科",
    "皮泌" => "皮膚科",
    "皮膚" => "皮膚科",
    "眞" => "不明",

    "眼" => "眼科",

    "矯" => "歯科矯正科",

    "矯正" => "歯科矯正科",
    "矯正歯" => "歯科矯正科",
    "矯正歯科" => "歯科矯正科",
    "矯歯" => "歯科矯正科",

    "神" => "神経科",
    "神経" => "神経科",

    "神内" => "神経内科",
    "神経内科" => "神経内科",


    "精内" => "不明",

    "精" => "精神科",
    "精神" => "精神科",

    "美" => "美容外科",

    "美外" => "美容外科",
    "美容外科" => "美容外科",

    "耳" => "耳鼻咽喉科",
    "耳咽" => "耳鼻咽喉科",
    "耳鼻" => "耳鼻咽喉科",
    "耳鼻咽" => "耳鼻咽喉科",
    "耳鼻咽喉" => "耳鼻咽喉科",

    "肛" => "肛門科",
    "肛門" => "肛門科",
    "肛門リハ" => "不明",

    "胃" => "胃腸科",
    "胃腸" => "胃腸科",

    "脳" => "脳神経外科",
    "脳外" => "脳神経外科",

    "脳神" => "脳神経外科",
    "脳神外" => "脳神経外科",
    "脳神経外科" => "脳神経外科",

    "腔内外" => "不明",

    "透" => "不明",
    "骨" => "不明",
    "麻" => "麻酔科",
    "麻酔" => "麻酔科",

    "ﾍﾟｲﾝｸﾘﾆｯｸ科" => "不明",

    "リウ" => "リウマチ科",
    "リウマチ" => "リウマチ科",
    "リハ" => "リウマチ科",
    "リハビリ" => "リウマチ科",
    "リュ" => "リウマチ科",
    "リュウ" => "リウマチ科",
    "リュウマチ" => "リウマチ科",
    "リューマチ" => "リウマチ科",
    "リユ" => "リウマチ科",
    "ﾘｭｳ" => "リウマチ科",
    "ﾘｭｳﾏﾁ" => "リウマチ科",
    "ﾘｳ" => "リウマチ科",
    "ﾘﾊ" => "リハビリテーション科",
}
SEPARATORS = /[、・･，,。 "　 \n]+/

# [{:number => "",:replaced => [マッピングできなかった文字列]}]
foul_results = []

hospitals = Hospital.all
hospitals.each do |hospital|
  result = {:number => hospital.number, :replaced => []}
  unless hospital.subject
    p "#{hospital.number}の診療科がない"
    next
  end

  splitted_subject = hospital.subject.split(SEPARATORS)
  splitted_subject.each do |ss|
    normalized_subject = NORMALIZE_MAP[ss]
    if normalized_subject
      # 正規化マップからマッピングする
      subject = Subject.find_by(:name => normalized_subject)
      p "subject:(#{ss})→(#{normalized_subject})→#{subject}"
      HospitalSubject.seed(:hospital_id, :subject_id) do |hs|
        hs.hospital_id = hospital.id
        hs.subject_id = subject.id
      end
    else
      # 正規化マップに存在しない
      result[:replaced] << ss
    end
  end
  foul_results << result
end

p "正規化マップに存在しない文字列"
p foul_results.select { |r| r[:replaced].present? }